       IDENTIFICATION DIVISION.
       PROGRAM-ID. SEMGREP-TEST-COBOL.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION
       SOURCE-COMPUTER. IBM-370.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 INPUT-USER           PIC X(20).
       77 INPUT-PASS           PIC X(20).
       * --- ruleid : vuln hardcoded ---
       77 ADMIN-USER           PIC X(10) VALUE 'ADMIN'.
       * --- ruleid : vuln hardcoded ---
       77 ADMIN-PASS           PIC X(10) VALUE 'SECRET123'. 


       PROCEDURE DIVISION.              

* --- Hardcoded Secrets ---
       DISPLAY "Enter username: ".
       ACCEPT INPUT-USER.             
       DISPLAY "Enter password: ".
       ACCEPT INPUT-PASS.             
       IF INPUT-USER = ADMIN-USER AND INPUT-PASS = ADMIN-PASS
           DISPLAY "Access granted."
       ELSE
           DISPLAY "Access denied.".
           

       * --- ruleid : vuln hardcoded ---
       MOVE "Authorization"              TO AUTH-HEADER
       MOVE LENGTH OF AUTH-HEADER        TO AUTH-HEADER-LEN
       MOVE "Basic qwertylogin=="        TO AUTH-HEADER-VALUE
       EXEC CICS WEB WRITE
              HTTPHEADER   (AUTH-HEADER)
              NAMELENGTH   (AUTH-HEADER-LEN)
              SESSTOKEN    (SESSION-TOKEN)
              VALUE        (AUTH-HEADER-VALUE)
              VALUELENGTH  (AUTH-HEADER-VALUE-LEN)
       END-EXEC
       
       
       
       * --- ruleid : vuln hardcoded ---
       STRING 'DRIVER={MariaDB ODBC 3.0 Driver};'
                  'SERVER=10.0.1.2;'
                  'PORT=3306;'
                  'DATABASE=coboldb;'
                  'USER=cobolusr;'
                  'PASSWORD=cobolPass;'
                  'COMPERSSED_PROTO=0;'
                  'TRACE=0'
       INTO BUFFER.
       

* --- Information Leak via Comments ---
       * --- ruleid : vuln info leak ---
       *> PASSWORD=SECRET123 stored here
       
       * --- ruleid : ok info leak ---
       * -- TODO: set variable TEST = abc123web --
       
       * --- ruleid : vuln info leak ---
       * -- CRYPTO key = abc123web --


       STOP RUN.
